Diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорРеализация</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияПоДоговору</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СозданиеРеализации(Команда)
	
	//таже процедура автозаполнения из модуля документа, только перенес ее сюда. не получилось достучаться до процедуры автозаполнения
	СозданиеРеализацииНаСервере();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СозданиеРеализацииНаСервере()
	
	Для Каждого Строки Из Объект.ДоговорРеализация Цикл
		
		ДокументРеализации = Строки.РеализацияПоДоговору;
		ПолученныйДокумент = ДокументРеализации.ПолучитьОбъект();  
		
		АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		РаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
		
		Если Не ЗначениеЗаполнено(АбонентскаяПлата) Тогда
			ОбщегоНазначения.СообщитьПользователю("Абонентская плата не заполнена");
			Возврат;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(РаботыСпециалиста) Тогда
			ОбщегоНазначения.СообщитьПользователю("Работы специалиста не заполены");
			Возврат;
		КонецЕсли;
		
		ПолученныйДокумент.Услуги.Очистить();
		
		АбонентскаяПлатаИзДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строки.Договор, "ВКМ_СуммаАбонентскойПлаты");
		
		Если АбонентскаяПлатаИзДоговора > 0 Тогда
			
			НоваяСтрока = ПолученныйДокумент.Услуги.Добавить();
			НоваяСтрока.Номенклатура = АбонентскаяПлата;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = АбонентскаяПлатаИзДоговора;
			НоваяСтрока.Сумма = АбонентскаяПлатаИзДоговора; 
					
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0)) КАК СуммаКОплате,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0)) КАК КоличествоЧасов
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			,
		|			Клиент = &Клиент
		|				И Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор";
		
		Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПолученныйДокумент.Дата));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПолученныйДокумент.Дата));
		Запрос.УстановитьПараметр("Клиент", ПолученныйДокумент.Контрагент);	
		Запрос.УстановитьПараметр("Договор", ПолученныйДокумент.Договор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.СуммаКОплате > 0 Тогда
				НоваяСтрока = ПолученныйДокумент.Услуги.Добавить();
				НоваяСтрока.Номенклатура = РаботыСпециалиста;
				НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоЧасов;
				НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаКОплате;
				НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаКОплате;
			КонецЕсли;
			
		КонецЦикла;
		
		СуммаДокумента = ПолученныйДокумент.Товары.Итог("Сумма") + ПолученныйДокумент.Услуги.Итог("Сумма");
		
		ПолученныйДокумент.Записать(); 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполнение документов закончено";
		Сообщение.Сообщить();
		
	КонецЦикла;

	//ДлительноеФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне(ДокументРеализации.ВКМ_ВыполнитьАвтозаполнение(ДокументРеализацииСсылка), ПараметрыЗапуска, ПараметрыВыполнения);	

КонецПроцедуры
#КонецОбласти
